{
  "title": "🚀 Kickstart Your Full Stack Journey! 🌍",
  "description": "Hi Chrismas! As a beginner aspiring to become a full-stack developer, I've crafted this learning path tailored just for you. Since you already have a background in Python, we will focus on web development technologies that complement and enhance your skills. I've selected resources that provide a solid foundation in both JavaScript and React, essential tools for modern web development. The 'JavaScript for Beginners Introduction' video is perfect for you as it lays the groundwork for understanding JavaScript, which is crucial for front-end development. Following that, the 'React for Beginners' video will introduce you to building interactive user interfaces, enabling you to create engaging web applications. With your commitment of 3 hours per week, these resources will help you kickstart your journey towards landing a job in the web development field!",
  "resources": [
    {
      "id": "d6367ee5-b069-4118-ab7f-625826dfcd91",
      "title": "Javascrit for beginners Introduction",
      "description": "This video introduces viewers to the fundamentals of JavaScript programming. The instructor emphasizes the importance of having a basic understanding of HTML and CSS, as JavaScript interacts with these technologies to enhance web pages. The tutorial outlines the course structure, which will cover JavaScript syntax, data types, control flow, and the Document Object Model (DOM), crucial for manipulating web elements. The instructor also recommends using the Brackets text editor and Google Chrome for development, highlighting their features that facilitate coding. Overall, this lesson sets the foundation for beginners to start their journey in JavaScript programming.",
      "link": "https://www.youtube.com/embed/watch?v=qoSksQ4s_hg&list=PL4cUxeGkcC9i9Ae2D9Ee1RvylH38dKuET",
      "author": "Net ninja",
      "hours": "3 minutes"
    },
    {
      "id": "55cd3a3d-a3d4-4b7f-b104-910eb18ccce7",
      "title": "React for beginners",
      "description": "The video titled \"Master React 18 with TypeScript!\" is an introductory tutorial designed for beginners looking to learn React. The instructor, Mosh Hamedani, outlines the course structure and emphasizes that no prior knowledge of React is necessary, although a good understanding of HTML, CSS, and JavaScript is recommended. The tutorial covers setting up the development environment, including the installation of Node.js and Visual Studio Code, and demonstrates how to create a new React application using tools like Create React App and Vite. Key concepts such as components, state management, props, and event handling are introduced, with practical examples provided throughout. The course aims to equip learners with the skills to build dynamic and interactive web applications using React and TypeScript, culminating in a project that involves creating a production-grade app for discovering video games.",
      "link": "https://www.youtube.com/embed/SqcY0GlETPk",
      "author": "Programming with Mosh",
      "hours": "1 hour 20 minutes"
    }
  ]
}
